ryan_churay/ruby_stack/rails_ii/DojoSecrets4/app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "secret_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 257], ["secret_id", 223], ["created_at", "2018-12-11 20:54:38.914779"], ["updated_at", "2018-12-11 20:54:38.914779"]]
---
  def create
    Like.create(user_id: session[:user_id], secret_id: params[:secret][:secret_id])

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 45]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 45]]
---
  def destroy
    @like = Like.find(params[:id])
    if session[:user_id] == @like.user_id
      @like.destroy