ryan_churay/ruby_stack/rails_ii/DojoSecrets4/app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets"
SELECT COUNT(*) AS count_all, "likes"."secret_id" AS likes_secret_id FROM "likes" GROUP BY "likes"."secret_id"
---
  def index
    @secrets = Secret.all
    @count = Like.group(:secret_id).count

INSERT INTO "secrets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "My new secret"], ["user_id", 92], ["created_at", "2018-12-10 23:31:20.001306"], ["updated_at", "2018-12-10 23:31:20.001306"]]
---
  def create
    @secret = Secret.new(secret_params)
    if @secret.valid?
      @secret.save

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 152]]
DELETE FROM "secrets" WHERE "secrets"."id" = $1  [["id", 152]]
---
  def destroy
    @secret = Secret.find(params[:id])
    if @secret.user_id == session[:user_id]
      @secret.destroy