ryan_churay/ruby_stack/rails_ii/DojoSecrets4/app/controllers/sessions_controller.rb

  def create
    # Log User In
    # puts params[:user][:email]
    @user = User.find_by_email(params[:user][:email]).try(:authenticate, params[:user][:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "oscar@gmail.com"]]