henry_kim/Ruby_on_rails/Controllers/IntegratingModels/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Hello"], ["created_at", "2018-12-01 16:53:29.882364"], ["updated_at", "2018-12-01 16:53:29.882364"]]
---
  def createUser
    @user = User.create( name: params[:name])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "I changed this"], ["updated_at", "2018-12-01 17:24:17.844050"], ["id", 1]]
---
  def update
    p @user
    user = User.find(params[:id])
    user.name = params[:name]
    user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def profile
    @user = User.find(params[:id])

SELECT "users".* FROM "users"
---
  def totalUser
    users = User.all