ryan_churay/ruby_stack/rails_ii/DojoSecrets4/app/views/users/show.html.erb

  <% end %>
  <p><%= secret.likes.count %></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 34]]