ryan_churay/ruby_stack/rails_ii/DojoSecrets4/app/views/secrets/index.html.erb


    <% secret.likes.each do |i| %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 206]]