chris_truax/ruby_stack/first_vagrant_box/railsII/DojoSecrets4/app/views/secrets/index.html.erb

  <p><%= secret.content %></p>
  <p><%= secret.likes.count %> likes</p>
    <% if secret.users.include?(current_user)%>
        <% secret.likes.each do |like| %>
            <% if current_user.likes.include?(like) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."secret_id" = $1 AND "users"."id" = $2 LIMIT 1  [["secret_id", 4], ["id", 1]]
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."secret_id" = $1  [["secret_id", 1]]
SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 3]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."secret_id" = $2  [["user_id", 1], ["secret_id", 4]]