chris_truax/ruby_stack/first_vagrant_box/railsII/DojoSecrets4/app/controllers/likes_controller.rb

  def create
    Like.create(user: current_user, secret: Secret.find(params[:like][:secret_id]))
---
INSERT INTO "likes" ("user_id", "secret_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["secret_id", 4], ["created_at", "2018-12-11 18:16:13.301140"], ["updated_at", "2018-12-11 18:16:13.301140"]]
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 4]]

  def destroy
    @like = Like.find(params[:id])
    if @like.user_id == session[:user_id]
      @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 7]]