chris_truax/ruby_stack/first_vagrant_box/railsII/DojoSecrets4/app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets"
---
  def index
    @secrets = Secret.all

INSERT INTO "secrets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "I am a secret three"], ["user_id", 0], ["created_at", "2018-12-11 04:35:47.013906"], ["updated_at", "2018-12-11 04:35:47.013906"]]
---
  def create
    @secret = Secret.new(secret_params)
    if @secret.valid?
      @secret.save

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "secrets" WHERE "secrets"."id" = $1  [["id", 7]]
---
  def destroy
    @secret = Secret.find(params[:id])
    if @secret.user_id == session[:user_id]
      @secret.destroy