chris_truax/ruby_stack/first_vagrant_box/railsII/DojoSecrets4/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "crittertruax@gmail.com"]]
---
  def create
    # Log User In
    # puts params[:user][:email]
    @user = User.find_by_email(params[:user][:email]).try(:authenticate, params[:user][:password])