chris_truax/ruby_stack/first_vagrant_box/railsII/DojoSecrets4/app/controllers/users_controller.rb

  def show
    @secrets = User.find(params[:id]).secrets
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "secrets".* FROM "secrets" INNER JOIN "likes" ON "secrets"."id" = "likes"."secret_id" WHERE "likes"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user = current_user
    if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Another Name"], ["email", "correct@email.com"], ["updated_at", "2018-12-10 21:51:51.492972"], ["id", 29]]

  def destroy
    session[:user_id] = nil
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 60]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 60]]